erp/frontend/modules/documents/views/erp-requisition/index.php

                                            $row7 = $command7->queryOne();


                                            $user0=User::find()->where(['user_id'=>$row['requested_by']])->One();
---
SELECT * FROM `user` WHERE `user_id`='54'