erp/frontend/controllers/SiteController.php

    public function actionLogin()
    {


     $this->layout='login';

        if (!Yii::$app->user->isGuest) {
            return $this->goHome();

        }

        $model = new LoginForm();
        if ($model->load(Yii::$app->request->post())&&$model->login() ) {


                $model1=new ErpUserActivityLog();
                $model1->user=Yii::$app->user->identity->user_id;
                $model1->action='Login';
                $model1->save(false);
---
INSERT INTO `erp_user_activity_log` (`user`, `action`) VALUES (2, 'Login')