erp/frontend/modules/documents/controllers/ErpTravelRequestController.php

    protected function findModel($id)
    {
        if (($model = ErpTravelRequest::findOne($id)) !== null) {
---
SELECT * FROM `erp_travel_request` WHERE `id`='46'