erp/common/models/UserHelper.php

public static function getPositionInfo($_user)
{
    $subquery=ErpPersonsInPosition::find()->select(['position_id'])->where(["person_id"=>$_user,"status"=>1] )->orderBy(['id' => SORT_DESC])->AsArray()->one();
    $pos=ErpOrgPositions::find()->select('tbl_pos.*')
                            ->alias('tbl_pos')
                             ->where(['tbl_pos.id'=> $subquery['position_id']])
                             ->AsArray()->one();
---
SELECT `position_id` FROM `erp_persons_in_position` WHERE (`person_id`=2) AND (`status`=1) ORDER BY `id` DESC
SELECT `tbl_pos`.* FROM `erp_org_positions` `tbl_pos` WHERE `tbl_pos`.`id`='10'