erp/common/models/User.php

SELECT * FROM `user` WHERE (`user_id`=2) AND (`status`=10)
---
    public static function findIdentity($id)
    {
        return static::findOne(['user_id' => $id, 'status' => self::STATUS_ACTIVE]);

SELECT * FROM `user` WHERE (`email`='jmugisha@rac.co.rw') AND (`status`=10)
---
     public static function findByEmail($email)
    {
        return static::findOne(['email' => $email, 'status' => self::STATUS_ACTIVE]);