erp/frontend/modules/documents/views/erp-document/_form.php

SELECT * FROM `erp_document_type`
---
                <div id="step-1"  class="tab-pane" role="tabpanel">
                    <h2>Document Details</h2>

                     <?php $items=ArrayHelper::map(ErpDocumentType::find()->all(), 'id', 'type'); ?>

SELECT * FROM `erp_document_severity`
---


             <?php
  $items = ArrayHelper::map(ErpDocumentSeverity::find()->all(), 'id', 'severity');