erp/common/components/DocComponent.php

SELECT COUNT(*) FROM (SELECT DISTINCT `f`.`document` FROM `erp_document_flow_recipients` `f` INNER JOIN `erp_document` `d` ON d.id = f.document WHERE (`f`.`recipient` = 2) AND (`f`.`status` = 'pending') AND (`d`.`status` <> 'expired') AND (`f`.`is_new` = 1)) `c`
---
   public function pending($_user,$filter_new){

    $cond[]='and';
    $cond[]=['=', 'f.recipient', $_user];
    $cond[]=['=', 'f.status',Constants::STATE_PENDING];
    $cond[]= ['<>','d.status','expired'];

   if($filter_new){

     $cond[]=['=', 'f.is_new',Constants::STATE_NEW];
   }
   $count = ErpDocumentFlowRecipients::find()
    ->select(['f.document'])
    ->alias('f')
    ->innerJoin('erp_document d','d.id = f.document')
    ->where($cond)
    ->distinct()
    ->count();

SELECT COUNT(*) FROM (SELECT DISTINCT `f`.`document` FROM `erp_document_flow_recipients` `f` WHERE (`f`.`sender`=2) OR ((`f`.`recipient`=2) AND (`f`.`status`='archived'))) `c`
---
   public function outbox($_user){


   $count =ErpDocumentFlowRecipients::find()
    ->select(['f.document'])
    ->alias('f')
    ->andwhere(['f.sender'=>$_user])
     ->orWhere(['and',
           ['f.recipient'=>$_user],
           ['f.status'=>Constants::STATE_ARCHIVED]
       ])
    ->distinct()
    ->count();