erp/common/components/LogisticComponent.php

   public function pending($_user,$filter_new){

    $cond[]='and';
    $cond[]=['=', 'f.approver', $_user];
    $cond[]=['=', 'f.status',Constants::STATE_PENDING];
    $cond[]= ['<>','m.status','expired'];

   if($filter_new){

     $cond[]=['=', 'f.is_new',Constants::STATE_NEW];
   }
   $count = RequestApprovalFlow::find()
    ->alias('f')
    ->select(['request'])
    ->innerJoin('request_to_stock m','m.reqtostock_id = f.request')
    ->where($cond)
    ->distinct()
    ->count();
---
SELECT COUNT(*) FROM (SELECT DISTINCT `request` FROM `request_approval_flow` `f` INNER JOIN `request_to_stock` `m` ON m.reqtostock_id = f.request WHERE (`f`.`approver` = 2) AND (`f`.`status` = 'pending') AND (`m`.`status` <> 'expired') AND (`f`.`is_new` = 1)) `c`