erp/common/components/LpoComponent.php

   public function pending($_user,$filter_new){

    $cond[]='and';
    $cond[]=['=', 'f.approver', $_user];
    $cond[]=['=', 'f.status',Constants::STATE_PENDING];
    $cond[]= ['<>','r.status',Constants::STATE_EXPIRED];

   if($filter_new){

     $cond[]=['=', 'f.is_new',Constants::STATE_NEW];
   }
   $count = ErpLpoApprovalFlow::find()
    ->select(['f.lpo'])
    ->alias('f')
    ->innerJoin('erp_lpo r','r.id = f.lpo')
    ->andwhere($cond)
    ->distinct()
    ->count();
---
SELECT COUNT(*) FROM (SELECT DISTINCT `f`.`lpo` FROM `erp_lpo_approval_flow` `f` INNER JOIN `erp_lpo` `r` ON r.id = f.lpo WHERE (`f`.`approver` = 2) AND (`f`.`status` = 'pending') AND (`r`.`status` <> 'expired')) `c`

   public function outbox($_user){


  $count =ErpLpoApprovalFlow::find()
   ->select(['f.lpo'])
    ->alias('f')
    ->andwhere(['f.originator'=>$_user])
     ->orWhere(['and',
           ['f.approver'=>$_user],
           ['f.status'=>Constants::STATE_COMPLETED]
       ])
    ->distinct()
    ->count();
---
SELECT COUNT(*) FROM (SELECT DISTINCT `f`.`lpo` FROM `erp_lpo_approval_flow` `f` WHERE (`f`.`originator`=2) OR ((`f`.`approver`=2) AND (`f`.`status`='completed'))) `c`