erp/common/components/LpoRequestComponent.php

   public function pending($_user,$filter_new){

    $cond[]='and';
    $cond[]=['=', 'f.approver', $_user];
    $cond[]=['=', 'f.status',Constants::STATE_PENDING];

    $cond[]= ['<>','r.status',Constants::STATE_EXPIRED];




   if($filter_new){

     $cond[]=['=', 'f.is_new',Constants::STATE_NEW];
   }
   $count = ErpLpoRequestApprovalFlow::find()
    ->select(['f.lpo_request'])
    ->alias('f')
    ->innerJoin('erp_lpo_request r','r.id = f.lpo_request')
    ->andwhere($cond)
    ->distinct()
    ->count();
---
SELECT COUNT(*) FROM (SELECT DISTINCT `f`.`lpo_request` FROM `erp_lpo_request_approval_flow` `f` INNER JOIN `erp_lpo_request` `r` ON r.id = f.lpo_request WHERE (`f`.`approver` = 2) AND (`f`.`status` = 'pending') AND (`r`.`status` <> 'expired')) `c`

   public function outbox($_user){


 $count =ErpLpoRequestApprovalFlow::find()
    ->select(['f.lpo_request'])
    ->alias('f')
    ->andwhere(['f.originator'=>$_user])
     ->orWhere(['and',
           ['f.approver'=>$_user],
           ['f.status'=>Constants::STATE_ARCHIVED]
       ])
    ->distinct()
    ->count();
---
SELECT COUNT(*) FROM (SELECT DISTINCT `f`.`lpo_request` FROM `erp_lpo_request_approval_flow` `f` WHERE (`f`.`originator`=2) OR ((`f`.`approver`=2) AND (`f`.`status`='archived'))) `c`