erp/common/components/MemoComponent.php

   public function pending($_user,$filter_new){

    $cond[]='and';
    $cond[]=['=', 'f.approver', $_user];
    $cond[]=['=', 'f.status',Constants::STATE_PENDING];
    $cond[]= ['<>','m.status','expired'];

   if($filter_new){

     $cond[]=['=', 'f.is_new',Constants::STATE_NEW];
   }
   $count = ErpMemoApprovalFlow::find()
    ->select(['f.memo_id'])
    ->alias('f')
    ->innerJoin('erp_memo m','m.id = f.memo_id')
    ->where($cond)
    ->distinct()
    ->count();
---
SELECT COUNT(*) FROM (SELECT DISTINCT `f`.`memo_id` FROM `erp_memo_approval_flow` `f` INNER JOIN `erp_memo` `m` ON m.id = f.memo_id WHERE (`f`.`approver` = 2) AND (`f`.`status` = 'pending') AND (`m`.`status` <> 'expired')) `c`

   public function outbox($_user){


   $count =ErpMemoApprovalFlow::find()
    ->select(['f.memo_id'])
    ->alias('f')
    ->andwhere(['f.originator'=>$_user])
     ->orWhere(['and',
           ['f.approver'=>$_user],
           ['f.status'=>Constants::STATE_ARCHIVED]
       ])
    ->distinct()
    ->count();
---
SELECT COUNT(*) FROM (SELECT DISTINCT `f`.`memo_id` FROM `erp_memo_approval_flow` `f` WHERE (`f`.`originator`=2) OR ((`f`.`approver`=2) AND (`f`.`status`='archived'))) `c`