erp/common/components/RequisitionComponent.php

   public function pending($_user,$filter_new){

    $cond[]='and';
    $cond[]=['=', 'f.approver', $_user];
    $cond[]=['=', 'f.status',Constants::STATE_PENDING];
    $cond[]= ['<>','r.approve_status',Constants::STATE_EXPIRED];

   if($filter_new){

     $cond[]=['=', 'f.is_new',Constants::STATE_NEW];
   }
   $count = ErpRequisitionApprovalFlow::find()
    ->select(['f.pr_id'])
    ->alias('f')
    ->innerJoin('erp_requisition r','r.id = f.pr_id')
    ->andwhere($cond)
    ->distinct()
    ->count();
---
SELECT COUNT(*) FROM (SELECT DISTINCT `f`.`pr_id` FROM `erp_requisition_approval_flow` `f` INNER JOIN `erp_requisition` `r` ON r.id = f.pr_id WHERE (`f`.`approver` = 2) AND (`f`.`status` = 'pending') AND (`r`.`approve_status` <> 'expired')) `c`

   public function outbox($_user){


   $count =ErpRequisitionApprovalFlow::find()
    ->select(['f.pr_id'])
    ->alias('f')
    ->andwhere(['f.originator'=>$_user])
     ->orWhere(['and',
           ['f.approver'=>$_user],
           ['f.status'=>Constants::STATE_COMPLETED]
       ])
    ->distinct()
    ->count();
---
SELECT COUNT(*) FROM (SELECT DISTINCT `f`.`pr_id` FROM `erp_requisition_approval_flow` `f` WHERE (`f`.`originator`=2) OR ((`f`.`approver`=2) AND (`f`.`status`='completed'))) `c`