erp/common/components/TravelRequestComponent.php

SELECT COUNT(*) FROM `erp_travel_request_approval_flow` `f` INNER JOIN `erp_travel_request` `tr` ON tr.id = f.tr_id WHERE (`f`.`approver` = 2) AND (`f`.`status` = 'pending') AND (`tr`.`status` <> 'expired')
---
   public function pending($_user,$filter_new){

    $cond[]='and';
    $cond[]=['=', 'f.approver', $_user];
    $cond[]=['=', 'f.status',Constants::STATE_PENDING];


    $cond[]= ['<>','tr.status','expired'];

   if($filter_new){

     $cond[]=['=', 'f.is_new',1];
   }
   $count = ErpTravelRequestApprovalFlow::find()
    ->alias('f')
    ->innerJoin('erp_travel_request tr','tr.id = f.tr_id')
    ->where($cond)
    ->count();

SELECT COUNT(*) FROM (SELECT DISTINCT * FROM `erp_travel_request_approval_flow` `f` WHERE (`f`.`originator`=2) OR ((`f`.`approver`=2) AND (`f`.`status`='archived'))) `c`
---
   public function outbox($_user){

  $count =ErpTravelRequestApprovalFlow::find()
    ->alias('f')
    ->andwhere(['f.originator'=>$_user])
     ->orWhere(['and',
           ['f.approver'=>$_user],
           ['f.status'=>Constants::STATE_ARCHIVED]
       ])
    ->distinct()
    ->count();