erp/common/components/UserComponent.php

SELECT `tbl_pos`.* FROM `erp_org_positions` `tbl_pos` INNER JOIN `erp_persons_in_position` `tbl_pp` ON `tbl_pp`.`position_id` = `tbl_pos`.`id` WHERE `tbl_pp`.`person_id`=2 ORDER BY `tbl_pp`.`id` DESC
---
   public function getPosInfo($_user,$current=true){

 $pos=ErpOrgPositions::find()->select('tbl_pos.*')
                            ->alias('tbl_pos')
                            ->innerJoin('erp_persons_in_position tbl_pp', '`tbl_pp`.`position_id` = `tbl_pos`.`id`')
                             ->where(['tbl_pp.person_id'=>$_user])
                             ->orderBy(['tbl_pp.id' => SORT_DESC])->one();