erp/frontend/modules/hr/models/EmpPayRevisions.php

SELECT COUNT(*) FROM `emp_pay_revisions` WHERE `status`='pending'
---
public static function countByStatus($status='pending'){


  $count =EmpPayRevisions::find()
                           ->where([
            'status' =>$status
        ])->count();