erp/frontend/modules/hr/components/EmployeeUtil.php

SELECT COUNT(*) FROM `employees` INNER JOIN `emp_employment` ON (`employees`.`id` = `emp_employment`.`employee`) AND ((`emp_employment`.`active`=1) AND (`employment_type`='PERM')) ORDER BY `emp_employment`.`id` DESC
---
  public function getEmpCountByEmplType($type,$count=0){

  $count= Employees::find()->select(['id'=>'emp_id'])->innerJoinWith([
    'employmentDetails' => function($q)use($type) {
      $q->andOnCondition(['employment_type' =>$type]);
    }
])->count();