erp/frontend/modules/hr/components/UnitComponent.php

 public function getRootedOutUnits(){
     $rows=ErpOrgUnits::find()->select('u.*,type.level_code')
                            ->alias('u')
                            ->innerJoin('erp_org_levels type', '`type`.`id` = `u`.`unit_level`')
                            ->where(['active'=>1,'parent_unit'=>1])
                            ->all();
---
SELECT `u`.*, `type`.`level_code` FROM `erp_org_units` `u` INNER JOIN `erp_org_levels` `type` ON `type`.`id` = `u`.`unit_level` WHERE (`active`=1) AND (`parent_unit`=1)

  public function getEmployees($orgUnit){

     $query=Employees::find()->alias('e')
                           ->innerJoin('emp_employment impl', '`impl`.`employee` = `e`.`id`');
     is_array($orgUnit)?  $query->where(['in','impl.org_unit', $orgUnit]) :  $query ->where(['impl.org_unit'=>$orgUnit ]);

     $query->andwhere([ 'e.status' =>'ACT' ]);

     return  $query ->count();
---
SELECT COUNT(*) FROM `employees` `e` INNER JOIN `emp_employment` `impl` ON `impl`.`employee` = `e`.`id` WHERE (`impl`.`org_unit` IN (4, 47, 48)) AND (`e`.`status`='ACT')

 public function getChildUnits($parent){

 $children=ErpOrgUnits::find()->select('u.*')
                            ->alias('u')
                            ->where(['parent_unit'=>$parent,'active'=>1])
                            ->all();
---
SELECT `u`.* FROM `erp_org_units` `u` WHERE (`parent_unit`=2) AND (`active`=1)