erp/frontend/modules/hr/views/default/index.php

SELECT * FROM `employment_type`
---
$roleID=Yii::$app->user->identity->user_level;

$leave=Yii::$app->leave;
$emplTypes=EmploymentType::find()->all();