erp/frontend/modules/documents/views/layouts/main.php

SELECT * FROM `erp_memo_categ`
---
<?php
  //-----------------------------memo types------------------------------------

     $mCategories=ErpMemoCateg::find()->all();